SCMframework/app/repositories/user_repository.rb

    def createUser(user)
      @is_user_create = user.save
---
INSERT INTO `users` (`name`, `email`, `password`, `profile`, `user_type`, `phone`, `address`, `dob`, `create_user_id`, `updated_user_id`, `deleted_user_id`, `deleted_at`, `created_at`, `updated_at`) VALUES ('ThetHtarAung', 'thethtaraung16617@gmail.com', '@tha#', '#<ActionDispatch::Http::UploadedFile:0x00000226127f5a78>', 'admin', '09451251444', 'myingyan', '2010-05-08', NULL, NULL, NULL, NULL, '2022-10-22 10:09:50.783479', '2022-10-22 10:09:50.783479')

    def getUserByID(id)
      @user = User.find(id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

    def updateUser(user, user_params)
      @is_user_update = user.update(user_params)
---
UPDATE `users` SET `users`.`name` = 'Hla Hla', `users`.`email` = 'hlahla@gmail.com', `users`.`updated_at` = '2022-10-24 07:02:54.405911' WHERE `users`.`id` = 1

    def destroyUser(user)
      #sql = "DELETE FROM users WHERE users.id = #{user.id}"
      @is_user_destroy = user.destroy
---
DELETE FROM `users` WHERE `users`.`id` = 62