SCMframework/app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'thethtar@gmail.com' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`password` = '1111' LIMIT 1
---
  def create
    user = User.find_by(email: params[:email])
    password = User.find_by(password: params[:password])