SCMframework/app/controllers/user_controller.rb

SELECT `users`.* FROM `users`
---
  def index

    #sql = "SELECT * FROM users"
    #@user = ActiveRecord::Base.connection.execute(sql)
    @user = User.all

INSERT INTO `users` (`name`, `email`, `password`, `profile`, `user_type`, `phone`, `address`, `dob`, `create_user_id`, `updated_user_id`, `deleted_user_id`, `deleted_at`, `created_at`, `updated_at`) VALUES ('ThetHtarAung', 'thethtaraung16617@gmail.com', '@tha#', '#<ActionDispatch::Http::UploadedFile:0x00000226127f5a78>', 'admin', '09451251444', 'myingyan', '2010-05-08', NULL, NULL, NULL, NULL, '2022-10-22 10:09:50.783479', '2022-10-22 10:09:50.783479')
---
  def create
    @user = User.new(user_params_create)
    @is_user_create = UserService.createUser(@user)

UPDATE `users` SET `users`.`name` = 'Hla Hla', `users`.`email` = 'hlahla@gmail.com', `users`.`updated_at` = '2022-10-24 07:02:54.405911' WHERE `users`.`id` = 1
---
  def update
    @user = UserService.getUserByID(params[:id])
    @is_user_update = UserService.updateUser(@user,user_params)

DELETE FROM `users` WHERE `users`.`id` = 62
---
  def destroy
    @user = UserService.getUserByID(params[:id])
    @is_user_destroy = UserService.deleteUser(@user)